ЖКХ/src/InformationRegisters/Показания/Показания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Показания</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Показание</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Недвижимость</name>
    <type>
      <types>CatalogRef.ОбъектыНедвижимости</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПриборУчета</name>
    <type>
      <types>CatalogRef.ПриборыУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ресурс</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыРесурсов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЖКХ/src/Catalogs/ЛицевыеСчета/ЛицевыеСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЛицевыеСчета</name>
  <attributes>
    <name>НомерСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Потребитель</name>
    <type>
      <types>CatalogRef.Потребители</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектНедвижимости</name>
    <type>
      <types>CatalogRef.ОбъектыНедвижимости</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийБаланс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПодключенныеРесурсы</name>
    <attributes>
      <name>ВидРесурса</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыРесурсов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриборУчета</name>
      <type>
        <types>CatalogRef.ПриборыУчета</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЖКХ/src/Catalogs/ОбъектыНедвижимости/ОбъектыНедвижимости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбъектыНедвижимости</name>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьОбщая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьЖилая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКомнат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПроживающих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбъектовНедвижимости</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Собственники</name>
    <attributes>
      <name>Потребитель</name>
      <type>
        <types>CatalogRef.Потребители</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоляСобственности</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИспользуемыеВидыРесурсов</name>
    <attributes>
      <name>ВидРесурса</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыРесурсов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЖКХ/src/CommonModules/ПотреблениеЖКХ/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает реквизиты приборов учета по ссылкам.
//
// Параметры:
//  ПриборыУчета - Массив из СправочникСсылка.ПриборыУчета - приборы учета.
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - СправочникСсылка.ПриборыУчета - прибор учета.
//   * Значение - СтрокаТаблицыЗначений - реквизиты прибора (ВидРесурса, Владелец).
//
Функция РеквизитыПриборов(ПриборыУчета) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриборыУчета.Ссылка КАК ПриборУчета,
	|	ПриборыУчета.ВидРесурса КАК ВидРесурса,
	|	ПриборыУчета.Владелец КАК Владелец
	|ИЗ
	|	Справочник.ПриборыУчета КАК ПриборыУчета
	|ГДЕ
	|	ПриборыУчета.Ссылка В (&ПриборыУчета)";
	Запрос.УстановитьПараметр("ПриборыУчета", ПриборыУчета);

	Результат = Новый Соответствие;
	Для Каждого СтрокаРезультата Из Запрос.Выполнить().Выгрузить() Цикл
		Результат.Вставить(СтрокаРезультата.ПриборУчета, СтрокаРезультата);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Возвращает последние показания приборов учета на дату.
//
// Параметры:
//  ПриборыУчета - Массив из СправочникСсылка.ПриборыУчета - приборы учета.
//  Дата - Дата - граница показаний (включительно).
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение - прибор учета и показание.
//
Функция ПредыдущиеПоказания(ПриборыУчета, Дата) Экспорт

	Результат = Новый Соответствие;

	Если ПриборыУчета.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоказанияСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	ПоказанияСрезПоследних.Показание КАК Показание
	|ИЗ
	|	РегистрСведений.Показания.СрезПоследних(&Дата, ПриборУчета В (&ПриборыУчета)) КАК ПоказанияСрезПоследних";
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ПриборыУчета", ПриборыУчета);

	Для Каждого СтрокаРезультата Из Запрос.Выполнить().Выгрузить() Цикл
		Результат.Вставить(СтрокаРезультата.ПриборУчета, СтрокаРезультата.Показание);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Возвращает соответствие "услуга - прибор учета" по подключенным ресурсам лицевого счета.
//
// Параметры:
//  ЛицевойСчет - СправочникСсылка.ЛицевыеСчета - лицевой счет.
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение - услуга и прибор учета.
//
Функция ПриборыУчетаПоУслугам(ЛицевойСчет) Экспорт

	Результат = Новый Соответствие;

	Если НЕ ЗначениеЗаполнено(ЛицевойСчет) Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПодключенныеРесурсы.ВидРесурса КАК ВидРесурса,
	|	ПодключенныеРесурсы.ПриборУчета КАК ПриборУчета
	|ИЗ
	|	Справочник.ЛицевыеСчета.ПодключенныеРесурсы КАК ПодключенныеРесурсы
	|ГДЕ
	|	ПодключенныеРесурсы.Ссылка = &ЛицевойСчет";
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);

	Для Каждого СтрокаРезультата Из Запрос.Выполнить().Выгрузить() Цикл
		Если ЗначениеЗаполнено(СтрокаРезультата.ВидРесурса) Тогда
			Результат.Вставить(СтрокаРезультата.ВидРесурса, СтрокаРезультата.ПриборУчета);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Возвращает объект недвижимости лицевого счета.
//
// Параметры:
//  ЛицевойСчет - СправочникСсылка.ЛицевыеСчета - лицевой счет.
//
// Возвращаемое значение:
//  СправочникСсылка.ОбъектыНедвижимости, Неопределено - объект недвижимости лицевого счета.
//
Функция ОбъектНедвижимостиЛицевогоСчета(ЛицевойСчет) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЛицевыеСчета.ОбъектНедвижимости КАК ОбъектНедвижимости
	|ИЗ
	|	Справочник.ЛицевыеСчета КАК ЛицевыеСчета
	|ГДЕ
	|	ЛицевыеСчета.Ссылка = &ЛицевойСчет";
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ОбъектНедвижимости;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

// Заполняет табличную часть "Услуги" документа видами ресурсов объекта недвижимости.
//
// Строки добавляются только по тем видам ресурсов, которых еще нет в табличной части,
// поэтому уже введенные строки не затрагиваются.
//
// Параметры:
//  ОбъектДокумента - ДокументОбъект.ВыставленныеСчета - документ, табличная часть которого заполняется.
//
Процедура ЗаполнитьУслугиПоНедвижимости(ОбъектДокумента) Экспорт

	Если НЕ ЗначениеЗаполнено(ОбъектДокумента.Недвижимость) Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИспользуемыеВидыРесурсов.ВидРесурса КАК ВидРесурса
	|ИЗ
	|	Справочник.ОбъектыНедвижимости.ИспользуемыеВидыРесурсов КАК ИспользуемыеВидыРесурсов
	|ГДЕ
	|	ИспользуемыеВидыРесурсов.Ссылка = &Недвижимость";
	Запрос.УстановитьПараметр("Недвижимость", ОбъектДокумента.Недвижимость);

	ЗаполненныеУслуги = Новый Соответствие;
	Для Каждого СтрокаУслуги Из ОбъектДокумента.Услуги Цикл
		Если ЗначениеЗаполнено(СтрокаУслуги.Услуга) Тогда
			ЗаполненныеУслуги.Вставить(СтрокаУслуги.Услуга, Истина);
		КонецЕсли;
	КонецЦикла;

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		Если ЗаполненныеУслуги[Выборка.ВидРесурса] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		СтрокаУслуги = ОбъектДокумента.Услуги.Добавить();
		СтрокаУслуги.Услуга = Выборка.ВидРесурса;
		ЗаполненныеУслуги.Вставить(Выборка.ВидРесурса, Истина);

	КонецЦикла;

КонецПроцедуры

#КонецОбласти
